In [2]:
import pandas as pd

# Q1

# 1) pandas can read the data from any sort of csv file by the following function:-

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

# 2) df.head(): by this function we can see the top 5 entries in the dataframe, but if we give argument as any other value, like df.head(3) then we will get just the top 3 entries.

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 3) df.dtypes: this function gives the datatypes of all the columns of a particular dataframe.

In [4]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# 4) df.info(): displays a concise summary of the DataFrame, including the data types, column names, and non-null values.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 5) df.sort_values('column_name'): this function allows us to sort the DataFrame by one or more columns.

In [6]:
df.sort_values('Fare')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C

# Q2

In [10]:
df1=df[['Pclass','Name','Age']]

In [17]:
df2=df1.rename(columns={'Pclass':'A','Name':'B','Age':'C'})

In [18]:
df2

     A                                                  B     C
0    3                            Braund, Mr. Owen Harris  22.0
1    1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2    3                             Heikkinen, Miss. Laina  26.0
3    1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4    3                           Allen, Mr. William Henry  35.0
..  ..                                                ...   ...
886  2                              Montvila, Rev. Juozas  27.0
887  1                       Graham, Miss. Margaret Edith  19.0
888  3           Johnston, Miss. Catherine Helen "Carrie"   NaN
889  1                              Behr, Mr. Karl Howell  26.0
890  3                                Dooley, Mr. Patrick  32.0

[891 rows x 3 columns]

# now we have got a bigger data frame named df2 to apply our reindexing method here.

In [33]:
def reindexing(df):
    new_index=pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    df_reindexed = df2.set_index(new_index)
    return df_reindexed
reindexing(df2)

      A                                                  B     C
1     3                            Braund, Mr. Owen Harris  22.0
3     1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
5     3                             Heikkinen, Miss. Laina  26.0
7     1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
9     3                           Allen, Mr. William Henry  35.0
...  ..                                                ...   ...
1773  2                              Montvila, Rev. Juozas  27.0
1775  1                       Graham, Miss. Margaret Edith  19.0
1777  3           Johnston, Miss. Catherine Helen "Carrie"   NaN
1779  1                              Behr, Mr. Karl Howell  26.0
1781  3                                Dooley, Mr. Patrick  32.0

[891 rows x 3 columns]

# Q3

In [34]:
def sum_of_three_values(df):
    first_three_values=df['Values'].head(3)
    sum_total=first_three_values.sum()
    print("The sum of 1st 3 values is:",sum_total)

In [36]:
df=pd.DataFrame({'name':['Alice','Bob','Claire','Daniel','Elaine'],
                'Values':[4,6,3,7,8]})

In [37]:
sum_of_three_values(df)

The sum of 1st 3 values is: 13

# Q4

In [38]:
# A function to create wprd count column in the existing dataframe
def create_word_count(df):
    df['word_count']=df['Text'].apply(lambda x:len(x.split()))
    return df

In [39]:
pd.set_option("display.max_colwidth",1000)# this is written to show the entire data on the console
df=pd.DataFrame({'Text':["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.","my name is vishal singh","i am a data science student"]})
create_word_count(df)

,Text,word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",104
1,my name is vishal singh,5
2,i am a data science student,6

# Q5

# DataFrame.size: returns the total number of elements in the DataFrame. It represents the product of the number of rows and the number of columns in the DataFrame.

In [44]:
df.size
# this returns the size of the dataframe taken in Q4

6

# Dataframe.shape: returns a tuple representing the dimensions of the DataFrame. The tuple contains two elements: the number of rows and the number of columns, respectively.

In [45]:
df.shape

(3, 2)

# Q6

# The function used to read data from excel file is pd.read_excel("file_name")

# Q7

In [55]:
def create_username(df):
    df['Username']=df['Email'].apply(lambda x: x.split(sep='@')[0])
    return df

In [59]:
d1={'Roll_no':[1,2,3,4,5],'Email':['vishal.singh29@gmail.com','antara.95@gmail.com','harpreet.h177@yahoo.com','ashutosh.30@redifmail.com','sanket.03@gmail.com']}

In [60]:
df=pd.DataFrame(d1)

In [61]:
create_username(df)

   Roll_no                      Email        Username
0        1   vishal.singh29@gmail.com  vishal.singh29
1        2        antara.95@gmail.com       antara.95
2        3    harpreet.h177@yahoo.com   harpreet.h177
3        4  ashutosh.30@redifmail.com     ashutosh.30
4        5        sanket.03@gmail.com       sanket.03

# Q8

In [19]:
def conditional_dataset(df):
    df1=df[(df['A']>5) & (df['B']<10)]
    return df1

In [20]:
data={'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}
ds=pd.DataFrame(data)

In [22]:
ds

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [21]:
conditional_dataset(ds)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9

In [23]:
df=pd.DataFrame({'name':['Alice','Bob','Claire','Daniel','Elaine'],
                'Values':[4,6,3,7,8]})

In [26]:
def mean_median_std(df):
    mean_value=df['Values'].mean()
    median_value=df['Values'].median()
    standard_deviation=df['Values'].std()
    return mean_value,median_value,standard_deviation

In [27]:
print("The mean, median and standard deviation of the dataset is:",mean_median_std(df))

The mean, median and standard deviation of the dataset is: (5.6, 6.0, 2.073644135332772)

# Q10

In [32]:
def moving_average(df):
    df['MovingAverage']=df['Sales'].rolling(window=7).mean()
    return df

In [33]:
data = {'Date': ['2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04', '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08', '2023-05-09'],
        'Sales': [10, 15, 12, 17, 20, 14, 16, 18, 13]}
df = pd.DataFrame(data)
moving_average(df)

         Date  Sales  MovingAverage
0  2023-05-01     10            NaN
1  2023-05-02     15            NaN
2  2023-05-03     12            NaN
3  2023-05-04     17            NaN
4  2023-05-05     20            NaN
5  2023-05-06     14            NaN
6  2023-05-07     16      14.857143
7  2023-05-08     18      16.000000
8  2023-05-09     13      15.714286

# Q11

In [69]:
def weekday(df):
    df['Weekday']=df['Date'].dt.day_name()
    return df

In [70]:
dates=pd.date_range(start="2023-05-01",end="2023-05-10")
date=pd.DataFrame({'Date':dates})

In [72]:
weekday(date)

        Date    Weekday
0 2023-05-01     Monday
1 2023-05-02    Tuesday
2 2023-05-03  Wednesday
3 2023-05-04   Thursday
4 2023-05-05     Friday
5 2023-05-06   Saturday
6 2023-05-07     Sunday
7 2023-05-08     Monday
8 2023-05-09    Tuesday
9 2023-05-10  Wednesday

# Q12

In [86]:
def select_rows_between_dates(df):
    start_date=pd.to_datetime('2023-01-01').date()
    end_date=pd.to_datetime('2023-01-31').date()
   
    index = (df['Date'].dt.date >= start_date) & (df['Date'].dt.date <= end_date)
    selected_rows = df.loc[index]
    return selected_rows

In [87]:
dates=pd.date_range(start="2022-12-01",end="2023-02-28",periods=20)
date1=pd.DataFrame({'Date':dates})

In [88]:
select_rows_between_dates(date1)

                            Date
7  2023-01-02 18:56:50.526315789
8  2023-01-07 11:22:06.315789473
9  2023-01-12 03:47:22.105263157
10 2023-01-16 20:12:37.894736842
11 2023-01-21 12:37:53.684210526
12 2023-01-26 05:03:09.473684210
13 2023-01-30 21:28:25.263157894

# Q13

# To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is "pandas" and its syntax is:
# import pandas as pd

# Here pd is the alias of pandas, because otherwise we have to write "pandas" in the complete code instead of 'pd'. We can give any alias as we want.